app/Controllers/Laporan.php

SELECT *
FROM `survei`
---
    public function laporan_bast() {
        $data = [
            'title' => 'Laporan Bast',
            'data' => $this->modelSurvei->findAll(),